---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElements
source: html/fdb603c0-d339-3693-1374-cefaa274aba2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinElements Property

Can't keep elements joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotJoinElements { get; }
```